# SetClTextureT

## Description
Procedure SetClTextureT sets the roof top texture of the specified class.

```pascal
PROCEDURE SetClTextureT(
				className  : STRING;
				textureRef : LONGINT);
```

```python

def vs.SetClTextureT(className, textureRef):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|className|STRING|Class name.|
|textureRef|LONGINT|Texture reference index value.|

## Remarks
Sets the roof top texture of the class named className.

## Version
Availability: from VectorWorks8.0
## Category
* Textures